team/case8/V_dbldbl/0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   nonuniform List<scalar> 
48900
(
0.739262
0.889036
1.02966
1.18667
1.25246
1.2958
1.33081
1.33761
...
)
;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           nonuniform List<scalar> 
60
(
0.375
0.375
0.375
0.375
0.375
0.375
0.375
0.375
...
)
;
    }
    outlet
    {
        type            zeroGradient;
    }
    upperWall
    {
        type            kqRWallFunction;
        value           nonuniform List<scalar> 
446
(
0.57907
0.674407
0.766551
0.888153
0.955633
1.00591
1.06268
1.10075
...
)
;
    }
    lowerWall
    {
        type            kqRWallFunction;
        value           nonuniform List<scalar> 
500
(
0.739262
0.889036
1.02966
1.18667
1.25246
1.2958
1.33081
1.33761
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
