team/case8/V_dbldbl/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   nonuniform List<scalar> 
48900
(
5.63527e-06
6.83983e-06
7.98184e-06
9.33524e-06
9.97563e-06
1.04237e-05
1.08584e-05
1.10677e-05
...
)
;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           nonuniform List<scalar> 
60
(
5e-06
5e-06
5e-06
5e-06
5e-06
5e-06
5e-06
5e-06
...
)
;
    }
    outlet
    {
        type            fixedValue;
        value           nonuniform List<scalar> 
114
(
5e-06
5e-06
5e-06
5e-06
5e-06
5e-06
5e-06
5e-06
...
)
;
    }
    upperWall
    {
        type            nutkWallFunction;
        value           uniform 0;
    }
    lowerWall
    {
        type            nutkWallFunction;
        value           nonuniform List<scalar> 
500
(
0
0
0
0
0
0
0
0
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
