team/case8/V_dbldbl/0/omega
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   nonuniform List<scalar> 
48900
(
62223.6
63790.8
65255.3
66840.6
67491.3
67918.9
68261.6
68327.9
...
)
;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           nonuniform List<scalar> 
60
(
314.4
314.4
314.4
314.4
314.4
314.4
314.4
314.4
...
)
;
    }
    outlet
    {
        type            zeroGradient;
    }
    upperWall
    {
        type            omegaWallFunction;
        value           nonuniform List<scalar> 
446
(
37146.7
38099.7
39015.1
40183.9
40814.5
41281.4
41801.6
42145.7
...
)
;
    }
    lowerWall
    {
        type            omegaWallFunction;
        value           nonuniform List<scalar> 
500
(
62223.6
63790.8
65255.3
66840.6
67491.3
67918.9
68261.6
68327.9
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
